## **Pandas Basic**

**Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.**

In [36]:
import pandas as pd
 
l=[4,8,15,16,23,42]
df = pd.Series(l)
type(df)
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

**Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.**

In [28]:
l=[i*10 for i in range(11)]
S= pd.Series(l)
S

0       0
1      10
2      20
3      30
4      40
5      50
6      60
7      70
8      80
9      90
10    100
dtype: int64

**Q3. Create a Pandas DataFrame that contains the following data:**

In [31]:
data=[["Alice",25,"Female"],["Bob",30,"Male"],["Claire",27,"Female"]]
df= pd.DataFrame(data,columns=["Name","Age","Gender"])
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

**Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.**

A DataFrame is a two-dimensional, size-mutable, and heterogeneous tabular data structure. It can be thought of as a collection of Series objects aligned along a common index. Each column in a DataFrame is essentially a Series.

A Series in pandas, on the other hand, is a one-dimensional labeled array that can hold data of any type, such as integers, strings, floats, etc. It has both data and an associated label (index) to identify each element.

In [34]:
## DataFrame
data=[["Alice",25,"Female"],["Bob",30,"Male"],["Claire",27,"Female"]]
df= pd.DataFrame(data,columns=["Name","Age","Gender"])
print(df)
print("----------------------------------------------------------")
l=[i*10 for i in range(11)]
S= pd.Series(l)
S

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
----------------------------------------------------------

0       0
1      10
2      20
3      30
4      40
5      50
6      60
7      70
8      80
9      90
10    100
dtype: int64

In [ ]:
**Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?**  

head() and tail(): These functions are used to view the first or last few rows of a DataFrame.  
info(): This function provides information about the DataFrame, including data types, non-null counts, and memory usage.  
describe(): This function generates summary statistics of the numeric columns in the DataFrame.  
sort_values(): Used to sort the DataFrame by one or more columns.  
groupby(): This function is used to group data based on values in one or more columns.

In [39]:
data=[["Ayush",23],["Aniket",19],["Prakhar",18],["Heet",20]]
df= pd.DataFrame(data,columns=["Name","Age"])
df

      Name  Age
0    Ayush   23
1   Aniket   19
2  Prakhar   18
3     Heet   20

In [40]:
df.head(3)

      Name  Age
0    Ayush   23
1   Aniket   19
2  Prakhar   18

In [41]:
df.tail(3)

      Name  Age
1   Aniket   19
2  Prakhar   18
3     Heet   20

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [45]:
print(df.describe())

             Age
count   4.000000
mean   20.000000
std     2.160247
min    18.000000
25%    18.750000
50%    19.500000
75%    20.750000
max    23.000000

In [46]:
df.sort_values("Age")

      Name  Age
2  Prakhar   18
1   Aniket   19
3     Heet   20
0    Ayush   23

In [49]:
print(df.groupby("Age").mean())

Empty DataFrame
Columns: []
Index: [18, 19, 20, 23]

/tmp/ipykernel_70/585311424.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  print(df.groupby("Age").mean())

In [50]:
df_without_name = df.drop(columns='Name')
print(df_without_name)

   Age
0   23
1   19
2   18
3   20

**Q6. Which of the following is mutable in nature Series, DataFrame, Panel?**  

Series: A Series is an immutable one-dimensional array-like object in pandas. Once created, you cannot change its elements or length directly.

DataFrame: A DataFrame is mutable, meaning you can modify its structure (add, remove, or modify columns) and data after creation. You can add or remove rows and columns, change values, and perform various operations on the DataFrame's contents.

Panel: As of pandas version 0.25.0, the Panel data structure has been removed from pandas due to its complexity and limited use cases. It was a three-dimensional data structure, but its removal reflects the focus on more common and useful structures like Series and DataFrame.

**Q7. Create a DataFrame using multiple Series. Explain with an example.**

In [51]:
Name = pd.Series(["Ayush","Alice","Wednesday"])
Age  = pd.Series([20,30,25])
Gender=pd.Series(['Male',"Male","Female"])

data={"Name":Name,"Age":Age,"Gender":Gender}
df= pd.DataFrame(data,columns=[""])